#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
aws_service_discovery_http_namespace.interview_project: Refreshing state... [id=ns-os4u4zahbptsybf5]
aws_efs_file_system.shared_storage: Refreshing state... [id=fs-0a7919a5db69e6ec1]
aws_eip.nat_2: Refreshing state... [id=eipalloc-0f02c45284c690413]
aws_ecs_cluster.main: Refreshing state... [id=arn:aws:ecs:us-east-1:816069151329:cluster/main]
aws_vpc.main: Refreshing state... [id=vpc-032a6f161e08d5410]
data.aws_iam_policy_document.ecs_task_execution_role: Reading...
aws_eip.nat_1: Refreshing state... [id=eipalloc-087e85560a57799da]
data.aws_iam_policy_document.ecs_task_execution_role: Read complete after 0s [id=1077804475]
aws_iam_role.ecs_task_execution_role: Refreshing state... [id=ecs-task-execution-role]
aws_ecs_task_definition.reverse_proxy: Refreshing state... [id=reverse-proxy]
aws_security_group.efs_sg: Refreshing state... [id=sg-09ab3c76375a428d3]
aws_security_group.alb_sg: Refreshing state... [id=sg-0a7d44cf9377799e9]
aws_subnet.reverse_proxy_1: Refreshing state... [id=subnet-092cf4c0e0d5d7cf2]
aws_subnet.wordpress_1: Refreshing state... [id=subnet-0c87dfef08f53a968]
aws_internet_gateway.gw: Refreshing state... [id=igw-023fe470033102e53]
aws_subnet.reverse_proxy_2: Refreshing state... [id=subnet-0511ae2aca668cf8f]
aws_security_group.aurora_sg: Refreshing state... [id=sg-06a71fdee05a78ef5]
aws_subnet.public_1: Refreshing state... [id=subnet-0f6a148c411bedf0c]
aws_subnet.wordpress_2: Refreshing state... [id=subnet-0d54284d694defe07]
aws_lb_target_group.reverse_proxy_tg: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:816069151329:targetgroup/reverse-proxy-tg/a05a7840a5705b81]
aws_subnet.public_2: Refreshing state... [id=subnet-03a57c292d204c5cf]
aws_security_group.reverse_proxy_sg: Refreshing state... [id=sg-0156a366114c9977f]
aws_lb.reverse_proxy_alb: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:816069151329:loadbalancer/app/reverse-proxy-alb/0ac6ea024f005fde]
aws_nat_gateway.nat_1: Refreshing state... [id=nat-08d2d0d477d50ca06]
aws_efs_mount_target.az_2: Refreshing state... [id=fsmt-047b34464075e4242]
aws_db_subnet_group.wordpress: Refreshing state... [id=wordpress]
aws_efs_mount_target.az_1: Refreshing state... [id=fsmt-07588e0fa884a497e]
aws_nat_gateway.nat_2: Refreshing state... [id=nat-05510aad7cab7a912]
aws_route_table.private_1: Refreshing state... [id=rtb-0f9e94c38ab825a92]
aws_route_table.private_2: Refreshing state... [id=rtb-0e252afce1b70d9d0]
aws_security_group.wordpress_sg: Refreshing state... [id=sg-0dcc26775dcf052d6]
aws_ecs_service.reverse_proxy_service: Refreshing state... [id=arn:aws:ecs:us-east-1:816069151329:service/main/reverse-proxy-service]
aws_route_table_association.wordpress_private_1: Refreshing state... [id=rtbassoc-0434085205ad15f31]
aws_route_table_association.reverse_proxy_private_1: Refreshing state... [id=rtbassoc-0a2df505f51fc61d0]
aws_route_table_association.reverse_proxy_private_2: Refreshing state... [id=rtbassoc-0d7e63eba8c4b639d]
aws_route_table_association.wordpress_private_2: Refreshing state... [id=rtbassoc-02e5bb86671850afa]
aws_appautoscaling_target.reverse_proxy_scaling_target: Refreshing state... [id=service/arn:aws:ecs:us-east-1:816069151329:cluster/main/reverse-proxy-service]
aws_lb_listener.reverse_proxy_listener: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:816069151329:listener/app/reverse-proxy-alb/0ac6ea024f005fde/853c9c2ef06630b4]
aws_rds_cluster.wordpress: Refreshing state... [id=wordpress]
aws_appautoscaling_policy.reverse_proxy_scale_up: Refreshing state... [id=reverse-proxy-scale-up]
aws_appautoscaling_policy.reverse_proxy_scale_down: Refreshing state... [id=reverse-proxy-scale-down]
aws_rds_cluster_instance.aurora_instance_2: Refreshing state... [id=aurora-instance-2]
aws_rds_cluster_instance.aurora_instance_1: Refreshing state... [id=aurora-instance-1]
aws_ecs_task_definition.wordpress: Refreshing state... [id=wordpress]
aws_ecs_service.wordpress: Refreshing state... [id=arn:aws:ecs:us-east-1:816069151329:service/main/wordpress-service]
aws_appautoscaling_target.wordpress_scaling_target: Refreshing state... [id=service/arn:aws:ecs:us-east-1:816069151329:cluster/main/wordpress-service]
aws_appautoscaling_policy.wordpress_scale_up: Refreshing state... [id=wordpress-scale-up]
aws_appautoscaling_policy.wordpress_scale_down: Refreshing state... [id=wordpress-scale-down]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_efs_mount_target.az_1 will be updated in-place
  ~ resource "aws_efs_mount_target" "az_1" {
        id                     = "fsmt-07588e0fa884a497e"
      ~ security_groups        = [
          - "sg-09ab3c76375a428d3",
        ] -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # aws_efs_mount_target.az_2 will be updated in-place
  ~ resource "aws_efs_mount_target" "az_2" {
        id                     = "fsmt-047b34464075e4242"
      ~ security_groups        = [
          - "sg-09ab3c76375a428d3",
        ] -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # aws_rds_cluster.wordpress will be updated in-place
  ~ resource "aws_rds_cluster" "wordpress" {
        id                                    = "wordpress"
        tags                                  = {}
      ~ vpc_security_group_ids                = [
          - "sg-06a71fdee05a78ef5",
        ] -> (known after apply)
        # (51 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_route_table.igw will be created
  + resource "aws_route_table" "igw" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + cidr_block                 = "0.0.0.0/0"
              + gateway_id                 = "igw-023fe470033102e53"
                # (11 unchanged attributes hidden)
            },
        ]
      + tags_all         = (known after apply)
      + vpc_id           = "vpc-032a6f161e08d5410"
    }

  # aws_route_table_association.public_1_igw will be created
  + resource "aws_route_table_association" "public_1_igw" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = "subnet-0f6a148c411bedf0c"
    }

  # aws_route_table_association.public_2_igw will be created
  + resource "aws_route_table_association" "public_2_igw" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = "subnet-03a57c292d204c5cf"
    }

  # aws_security_group.aurora_sg must be replaced
-/+ resource "aws_security_group" "aurora_sg" {
      ~ arn                    = "arn:aws:ec2:us-east-1:816069151329:security-group/sg-06a71fdee05a78ef5" -> (known after apply)
      ~ id                     = "sg-06a71fdee05a78ef5" -> (known after apply)
      ~ name                   = "terraform-20240825230952386900000003" -> "aurora_sg" # forces replacement
      ~ name_prefix            = "terraform-" -> (known after apply)
      ~ owner_id               = "816069151329" -> (known after apply)
      - tags                   = {} -> null
      ~ tags_all               = {} -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # aws_security_group.efs_sg must be replaced
-/+ resource "aws_security_group" "efs_sg" {
      ~ arn                    = "arn:aws:ec2:us-east-1:816069151329:security-group/sg-09ab3c76375a428d3" -> (known after apply)
      ~ id                     = "sg-09ab3c76375a428d3" -> (known after apply)
      ~ name                   = "terraform-20240825230952066400000002" -> "efs_sg" # forces replacement
      ~ name_prefix            = "terraform-" -> (known after apply)
      ~ owner_id               = "816069151329" -> (known after apply)
      - tags                   = {} -> null
      ~ tags_all               = {} -> (known after apply)
        # (5 unchanged attributes hidden)
    }

Plan: 5 to add, 3 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

</details>

*Pusher: @ravenoak, Action: `pull_request`, Working Directory: ``, Workflow: `Run Terraform`*